inventory_service_perf/wrk_report/inventory_python310_initial_fill_1k.txt
next_player_id is achive 100000 and reset to 1
next_player_id is achive 100000 and reset to 1
next_player_id is achive 100000 and reset to 1
[...]
Running 10m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 680.834ms, rate sampling interval: 2053ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.40s     3.47s   18.24s    65.84%
    Req/Sec     0.98k    46.68     1.04k    80.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.84s 
 75.000%    7.59s 
 90.000%   10.30s 
 99.000%   15.09s 
 99.900%   17.66s 
 99.990%   18.10s 
 99.999%   18.22s 
100.000%   18.25s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.167     0.000000            1         1.00
    1317.887     0.100000        57982         1.11
    2207.743     0.200000       115949         1.25
    3035.135     0.300000       173941         1.43
    3893.247     0.400000       231932         1.67
    4841.471     0.500000       289935         2.00
    5312.511     0.550000       318829         2.22
    5812.223     0.600000       347795         2.50
    6324.223     0.650000       376925         2.86
    6877.183     0.700000       405830         3.33
    7589.887     0.750000       434803         4.00
    7987.199     0.775000       449245         4.44
    8429.567     0.800000       463886         5.00
    8871.935     0.825000       478355         5.71
    9273.343     0.850000       492681         6.67
    9699.327     0.875000       507232         8.00
    9994.239     0.887500       514465         8.89
   10297.343     0.900000       521744        10.00
   10674.175     0.912500       529054        11.43
   11010.047     0.925000       536192        13.33
   11395.071     0.937500       543441        16.00
   11624.447     0.943750       547040        17.78
   11911.167     0.950000       550732        20.00
   12197.887     0.956250       554247        22.86
   12541.951     0.962500       557899        26.67
   12886.015     0.968750       561522        32.00
   13123.583     0.971875       563302        35.56
   13402.111     0.975000       565137        40.00
   13672.447     0.978125       566973        45.71
   13901.823     0.981250       568753        53.33
   14245.887     0.984375       570559        64.00
   14467.071     0.985938       571449        71.11
   14704.639     0.987500       572352        80.00
   14950.399     0.989062       573269        91.43
   15171.583     0.990625       574177       106.67
   15441.919     0.992188       575069       128.00
   15556.607     0.992969       575535       142.22
   15679.487     0.993750       575974       160.00
   15835.135     0.994531       576457       182.86
   15990.783     0.995313       576892       213.33
   16228.351     0.996094       577334       256.00
   16334.847     0.996484       577563       284.44
   16465.919     0.996875       577803       320.00
   16605.183     0.997266       578013       365.71
   16957.439     0.997656       578246       426.67
   17170.431     0.998047       578484       512.00
   17219.583     0.998242       578587       568.89
   17301.503     0.998437       578696       640.00
   17448.959     0.998633       578815       731.43
   17580.031     0.998828       578928       853.33
   17661.951     0.999023       579042      1024.00
   17694.719     0.999121       579090      1137.78
   17727.487     0.999219       579153      1280.00
   17760.255     0.999316       579201      1462.86
   17793.023     0.999414       579268      1706.67
   17842.175     0.999512       579325      2048.00
   17858.559     0.999561       579346      2275.56
   17874.943     0.999609       579372      2560.00
   17924.095     0.999658       579406      2925.71
   17956.863     0.999707       579435      3413.33
   18006.015     0.999756       579462      4096.00
   18022.399     0.999780       579474      4551.11
   18038.783     0.999805       579484      5120.00
   18071.551     0.999829       579511      5851.43
   18087.935     0.999854       579529      6826.67
   18087.935     0.999878       579529      8192.00
   18104.319     0.999890       579540      9102.22
   18104.319     0.999902       579540     10240.00
   18120.703     0.999915       579550     11702.86
   18153.471     0.999927       579572     13653.33
   18153.471     0.999939       579572     16384.00
   18153.471     0.999945       579572     18204.44
   18153.471     0.999951       579572     20480.00
   18153.471     0.999957       579572     23405.71
   18169.855     0.999963       579581     27306.67
   18169.855     0.999969       579581     32768.00
   18169.855     0.999973       579581     36408.89
   18186.239     0.999976       579586     40960.00
   18186.239     0.999979       579586     46811.43
   18186.239     0.999982       579586     54613.33
   18202.623     0.999985       579589     65536.00
   18202.623     0.999986       579589     72817.78
   18202.623     0.999988       579589     81920.00
   18219.007     0.999989       579591     93622.86
   18219.007     0.999991       579591    109226.67
   18235.391     0.999992       579593    131072.00
   18235.391     0.999993       579593    145635.56
   18235.391     0.999994       579593    163840.00
   18235.391     0.999995       579593    187245.71
   18251.775     0.999995       579596    218453.33
   18251.775     1.000000       579596          inf
#[Mean    =     5397.314, StdDeviation   =     3473.737]
#[Max     =    18235.392, Total count    =       579596]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  589030 requests in 10.00m, 104.48MB read
Requests/sec:    981.72
Transfer/sec:    178.32KB