inventory_service_perf/wrk_report/inventory_python310_metrics_error_logger_wrk.txt
dr@eniac-bench:~/devel/wrk2$ ./wrk  --latency -t1 -R1200  -c 100 -d 120  http://eniac-bench:8080/metrics
Running 2m test @ http://eniac-bench:8080/metrics
  1 threads and 100 connections
  Thread calibration: mean lat.: 1.978ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.00ms  738.02us  14.41ms   74.43%
    Req/Sec     1.27k    97.24     1.67k    76.97%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.90ms
 75.000%    2.39ms
 90.000%    2.86ms
 99.000%    3.96ms
 99.900%    8.33ms
 99.990%   12.72ms
 99.999%   13.99ms
100.000%   14.41ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.712     0.000000            1         1.00
       1.177     0.100000        13151         1.11
       1.430     0.200000        26350         1.25
       1.589     0.300000        39468         1.43
       1.744     0.400000        52618         1.67
       1.901     0.500000        65717         2.00
       1.987     0.550000        72326         2.22
       2.073     0.600000        78929         2.50
       2.163     0.650000        85432         2.86
       2.269     0.700000        92081         3.33
       2.389     0.750000        98595         4.00
       2.453     0.775000       101927         4.44
       2.521     0.800000       105168         5.00
       2.593     0.825000       108469         5.71
       2.669     0.850000       111758         6.67
       2.755     0.875000       115000         8.00
       2.805     0.887500       116638         8.89
       2.863     0.900000       118262        10.00
       2.935     0.912500       119940        11.43
       3.019     0.925000       121556        13.33
       3.111     0.937500       123211        16.00
       3.159     0.943750       124025        17.78
       3.209     0.950000       124836        20.00
       3.267     0.956250       125658        22.86
       3.335     0.962500       126478        26.67
       3.473     0.968750       127307        32.00
       3.545     0.971875       127708        35.56
       3.653     0.975000       128115        40.00
       3.745     0.978125       128529        45.71
       3.811     0.981250       128941        53.33
       3.867     0.984375       129356        64.00
       3.895     0.985938       129562        71.11
       3.923     0.987500       129766        80.00
       3.947     0.989062       129982        91.43
       3.983     0.990625       130176       106.67
       4.027     0.992188       130383       128.00
       4.093     0.992969       130479       142.22
       4.179     0.993750       130580       160.00
       4.355     0.994531       130683       182.86
       4.435     0.995313       130786       213.33
       4.491     0.996094       130890       256.00
       4.523     0.996484       130942       284.44
       4.555     0.996875       130991       320.00
       4.587     0.997266       131045       365.71
       4.623     0.997656       131093       426.67
       4.747     0.998047       131144       512.00
       5.039     0.998242       131170       568.89
       5.543     0.998437       131195       640.00
       6.255     0.998633       131222       731.43
       7.355     0.998828       131247       853.33
       8.455     0.999023       131272      1024.00
       9.071     0.999121       131285      1137.78
       9.567     0.999219       131298      1280.00
       9.951     0.999316       131311      1462.86
      10.335     0.999414       131324      1706.67
      10.743     0.999512       131336      2048.00
      10.959     0.999561       131343      2275.56
      11.151     0.999609       131349      2560.00
      11.335     0.999658       131356      2925.71
      11.519     0.999707       131362      3413.33
      11.615     0.999756       131368      4096.00
      11.847     0.999780       131372      4551.11
      12.039     0.999805       131375      5120.00
      12.151     0.999829       131378      5851.43
      12.311     0.999854       131381      6826.67
      12.479     0.999878       131384      8192.00
      12.591     0.999890       131386      9102.22
      12.743     0.999902       131388     10240.00
      13.183     0.999915       131389     11702.86
      13.447     0.999927       131392     13653.33
      13.447     0.999939       131392     16384.00
      13.471     0.999945       131393     18204.44
      13.679     0.999951       131395     20480.00
      13.679     0.999957       131395     23405.71
      13.703     0.999963       131396     27306.67
      13.703     0.999969       131396     32768.00
      13.767     0.999973       131397     36408.89
      13.767     0.999976       131397     40960.00
      13.967     0.999979       131398     46811.43
      13.967     0.999982       131398     54613.33
      13.967     0.999985       131398     65536.00
      13.991     0.999986       131399     72817.78
      13.991     0.999988       131399     81920.00
      13.991     0.999989       131399     93622.86
      13.991     0.999991       131399    109226.67
      13.991     0.999992       131399    131072.00
      14.415     0.999993       131400    145635.56
      14.415     1.000000       131400          inf
#[Mean    =        1.996, StdDeviation   =        0.738]
#[Max     =       14.408, Total count    =       131400]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  143752 requests in 2.00m, 1.01GB read
Requests/sec:   1197.93
Transfer/sec:      8.65MB